Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЦеныТоваров
	Движения.ЦеныТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ЦеныТоваров.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Дата = Дата;
		Движение.Цена = ТекСтрокаТовары.Цена;
	КонецЦикла;
	
	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	// регистр ВзаиморасчётыСПокупателями Приход
	Движения.ВзаиморасчётыСПокупателями.Записывать = Истина;
	Движение = Движения.ВзаиморасчётыСПокупателями.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Покупатель = Контрагент;
	Движение.Договор = Договор;
	Движение.Сумма = СуммаИтого;
	
	// регистр ВыручкаИСебестоимостьПродаж
	Движения.ВыручкаИСебестоимостьПродаж.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		// Средняя себестоимость по товару на момент продажи
		СредняяСебестоимость = РассчитатьСреднююСебестоимость(ТекСтрокаТовары .Товар, Дата);
		
		Движение = Движения.ВыручкаИСебестоимостьПродаж.Добавить();
		Движение.Период = Дата;
		Движение.Товары = ТекСтрокаТовары .Товар;
		Движение.Количество = ТекСтрокаТовары .Количество;
		Движение.Выручка = ТекСтрокаТовары .Сумма;
		Движение.Себестоимость = СредняяСебестоимость * ТекСтрокаТовары .Количество;
		
	КонецЦикла;
	
КонецПроцедуры


Функция РассчитатьСреднююСебестоимость(Товар, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество,
	|    ОстаткиТоваровОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|    РегистрНакопления.ОстаткиТоваров.Остатки(&Дата, Товар = &Товар) КАК ОстаткиТоваровОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Товар", Товар);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() И Результат.Количество > 0 Тогда
		Возврат Результат.Сумма / Результат.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

